Revit 2024 API
BuiltInFailures.RebarFailures.CannotPlaceRebar Property
 Can't find a host for Rebar.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId CannotPlaceRebar { get; }
Visual Basic
Public Shared ReadOnly Property CannotPlaceRebar As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ CannotPlaceRebar {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.RebarFailures Class
Autodesk.Revit.DB Namespace